spec/support/vcr_cassettes/preneeds/burial_forms/creates_a_pre_need_burial_form.yml

---
http_interactions:
- request:
    method: post
    uri: "<PRENEEDS_HOST>/eoas_SOA/PreNeedApplicationPort"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:tns="http://service.soa.eoas.cem.va.gov/"
        xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"><env:Body><tns:receivePreNeedApplication><preNeedRequest><applicant><applicantEmail>hg@hotmail.com</applicantEmail><applicantPhoneNumber>555-555-5555
        - 234</applicantPhoneNumber><applicantRelationshipToClaimant>Self</applicantRelationshipToClaimant><completingReason>I
        don&#39;t know</completingReason><mailingAddress><address1>street 1</address1><address2>street2
        1</address2><city>NY</city><countryCode>USA</countryCode><postalZip>10000</postalZip><state>NY</state></mailingAddress><name><firstName>first
        1</firstName><lastName>last 1</lastName><maidenName>maiden 1</maidenName><middleName>middle
        1</middleName><suffix>Jr.</suffix></name></applicant><applicationStatus>somewhere</applicationStatus><claimant><address><address1>street
        2</address1><address2>street2 2</address2><city>NY</city><countryCode>USA</countryCode><postalZip>10000</postalZip><state>NY</state></address><dateOfBirth>2001-01-31</dateOfBirth><desiredCemetery>400</desiredCemetery><email>a@b.com</email><name><firstName>first
        2</firstName><lastName>last 2</lastName><maidenName>maiden 2</maidenName><middleName>middle
        2</middleName><suffix>Jr.</suffix></name><phoneNumber>1234567890</phoneNumber><relationshipToVet>1</relationshipToVet><ssn>123-45-6789</ssn></claimant><currentlyBuriedPersons><cemeteryNumber>400</cemeteryNumber><name><firstName>first
        3</firstName><lastName>last 3</lastName><maidenName>maiden 3</maidenName><middleName>middle
        3</middleName><suffix>Jr.</suffix></name></currentlyBuriedPersons><currentlyBuriedPersons><cemeteryNumber>400</cemeteryNumber><name><firstName>first
        4</firstName><lastName>last 4</lastName><maidenName>maiden 4</maidenName><middleName>middle
        4</middleName><suffix>Jr.</suffix></name></currentlyBuriedPersons><hasAttachments>false</hasAttachments><hasCurrentlyBuried>1</hasCurrentlyBuried><sendingApplication>vets.gov</sendingApplication><sendingCode>abc</sendingCode><sentTime>2020-08-13T03:25:19Z</sentTime><trackingNumber>u6HaIsaeE5DodpGD8nVG</trackingNumber><veteran><address><address1>street
        3</address1><address2>street2 3</address2><city>NY</city><countryCode>USA</countryCode><postalZip>10000</postalZip><state>NY</state></address><currentName><firstName>first
        5</firstName><lastName>last 5</lastName><maidenName>maiden 5</maidenName><middleName>middle
        5</middleName><suffix>Jr.</suffix></currentName><dateOfBirth>2001-01-31</dateOfBirth><dateOfDeath>2001-01-31</dateOfDeath><gender>Male</gender><race><raceCd>I</raceCd></race><race><raceCd>U</raceCd></race><isDeceased>unsure</isDeceased><maritalStatus>Married</maritalStatus><militaryServiceNumber>123456789</militaryServiceNumber><placeOfBirth>Brooklyn,
        NY</placeOfBirth><serviceName><firstName>first 6</firstName><lastName>last
        6</lastName><maidenName>maiden 6</maidenName><middleName>middle 6</middleName><suffix>Jr.</suffix></serviceName><serviceRecords><branchOfService>AF</branchOfService><dischargeType>1</dischargeType><enteredOnDutyDate>1940-08-07</enteredOnDutyDate><highestRank>GEN</highestRank><nationalGuardState>NY</nationalGuardState><releaseFromDutyDate>1945-08-07</releaseFromDutyDate></serviceRecords><ssn>123-45-6789</ssn><vaClaimNumber>23456789</vaClaimNumber><militaryStatus>A</militaryStatus></veteran></preNeedRequest></tns:receivePreNeedApplication></env:Body></env:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Date:
      - Thu, 13 Aug 2020 03:25:19 GMT
      Content-Length:
      - '3526'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 13 Aug 2020 03:25:19 GMT
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><ns2:receivePreNeedApplicationResponse
        xmlns:ns2="http://service.soa.eoas.cem.va.gov/"><return><applicationUUID>29d0af3b-4929-418a-89c8-fa1d696a3886</applicationUUID><returnCode>0</returnCode><returnDescription>PreNeed
        Application Received Successfully.</returnDescription></return></ns2:receivePreNeedApplicationResponse></S:Body></S:Envelope>
  recorded_at: Thu, 13 Aug 2020 03:25:19 GMT
recorded_with: VCR 6.0.0
